trade/src/InformationRegisters/СортировкаСопутствующихВидовНоменклатуры/СортировкаСопутствующихВидовНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СортировкаСопутствующихВидовНоменклатуры</name>
  <resources>
    <name>Сортировка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СопутствующийВидНоменклатуры</name>
    <type>
      <types>CatalogRef.СопутствующиеВидыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/СортировкаСопутствующихВидовНоменклатуры/ManagerModule.bsl
Процедура ДополнитьЗаписиРегистраПоВидуНоменклатуры(ВидНоменклатуры) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СопутствующиеВидыНоменклатуры.Ссылка КАК Ссылка,
	|	СопутствующиеВидыНоменклатуры.Владелец КАК Владелец
	|ПОМЕСТИТЬ ВТ_ВидыНоменклатуры
	|ИЗ
	|	Справочник.СопутствующиеВидыНоменклатуры КАК СопутствующиеВидыНоменклатуры
	|ГДЕ
	|	НЕ СопутствующиеВидыНоменклатуры.ПометкаУдаления
	|	И СопутствующиеВидыНоменклатуры.Владелец = &ВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СортировкаСопутствующихВидовНоменклатуры.СопутствующийВидНоменклатуры КАК СопутствующийВидНоменклатуры,
	|	СортировкаСопутствующихВидовНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры
	|ПОМЕСТИТЬ ВТ_СортировкаСопутствующихВидов
	|ИЗ
	|	РегистрСведений.СортировкаСопутствующихВидовНоменклатуры КАК СортировкаСопутствующихВидовНоменклатуры
	|ГДЕ
	|	СортировкаСопутствующихВидовНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВидыНоменклатуры.Ссылка КАК СопутствующийВидНоменклатуры,
	|	ВТ_ВидыНоменклатуры.Владелец КАК ВидНоменклатуры
	|ИЗ
	|	ВТ_ВидыНоменклатуры КАК ВТ_ВидыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СортировкаСопутствующихВидов КАК ВТ_СортировкаСопутствующихВидов
	|		ПО ВТ_ВидыНоменклатуры.Ссылка = ВТ_СортировкаСопутствующихВидов.СопутствующийВидНоменклатуры
	|ГДЕ
	|	ВТ_СортировкаСопутствующихВидов.СопутствующийВидНоменклатуры ЕСТЬ NULL";

	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры); 

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Набор = РегистрыСведений.СортировкаСопутствующихВидовНоменклатуры.СоздатьНаборЗаписей(); 
	
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = Набор.Добавить();
		НоваяЗапись.ВидНоменклатуры = Выборка.ВидНоменклатуры;
		НоваяЗапись.СопутствующийВидНоменклатуры = Выборка.СопутствующийВидНоменклатуры;
		НоваяЗапись.Сортировка = 0;
	КонецЦикла;
	
	Набор.Записать(Ложь);
	
КонецПроцедуры
